package com.xpay.channel.common.enums;

/**
 * Created by suxinxin on 16/2/5.
 */
public enum EnumBankRtnCode {
    S0000("成功"),
    //银行返回结果为已经支付成功
    S1000("交易已支付成功"),
    S9999("未知"),
    P0000("处理中"),
    //银行返回交易正在处理中
    P1000("交易正在处理,请勿重复提交"),
    F0000("失败"),


    /**
     * 特殊失败，前台不跳转，后续去掉该码
     * 	后续删掉
     */
    F100107("100107"),

    F0001("网关返回参数异常"),
    F0002("查找不到原交易记录"),
    F0003("交易超限"),
    F0004("该交易已经是退货状态"),
    F0005("白条错误"),

    F1000("新建状态"),
    F1001("没有配置银行返回码到渠道返回码的映射"),
    F1002("请求退款处理失败"),
    F1003("退款金额错误,不一致或累计退款金额超过交易金额"),
    F1004("交易金额错误"),
    F1005("不支持或者不允许或无法退款"),
    F1006("交易订单在银行不存在"),
    F1007("退款订单在银行不存在"),
    F1008("商户账户金额不足，无法完成退款"),

    F1009("请求处理失败"),
    F1010("暂停商户服务,请联系银行"),
    F1011("日/月累计金额或笔数超限"),
    F1012("单笔金额超限"),
    F1013("卡信息错误(卡号与开户信息不符)"),
    F1014("卡密码错误"),
    F1015("卡已过期或有效期输入错误"),
    F1016("卡密码错误次数超限"),
    F1017("卡不支持该业务"),
    F1018("卡状态异常"),
    F1019("证件号或卡号或手机号错误"),
    F1020("卡号和证件号不符"),
    F1021("卡余额不足"),
    F1022("证件号有误"),
    F1023("手机号有误"),
    F1024("持卡人姓名有误"),
    F1025("短信验证码错误"),
    F1026("获取短信验证码失效"),
    F1027("短信验证码错误次数超限"),
    //    F1028("交易正在处理,请勿重复提交"),
//    F1029("交易已支付成功"),
    F1030("卡bin校验失败"),
    F1031("原交易状态未成功"),
    F1032("cvv2不正确"),
    F1033("获取验证码次数超限"),
    F1034("交易异常"),
    F1035("交易申请成功,需要再次进行验证"),
    F1036("卡已签约成功"),
    F1037("产品结算账户已开通"),
    F1038("商户内部账户已开通"),
    F1039("手机号使用次数超限"),
    F1040("商户未开通该银行"),
    F1041("订单状态不正确"),
    F1042("手机号或cvv2错误"),

    F1043("发卡行不正确或不支持"),
    F1044("卡类型不正确"),
    F1045("证件类型不正确"),
    F1046("交易重复"),
    F1047("cvv2或有效期错误"),
    F1048("日/月银行卡或手机号或身份证号使用次数超限"),
    F1049("交易已受理并处理成功，无法取消"),
    F1050("交易已经完成"),
    F1051("退货额度/日限额已经用完或退货金额超限"),
    F1052("交易状态不正确,请求失败"),
    F1053("姓名与身份证号不匹配"),
    F1054("银行交易出错，请稍后重试"),
    F1055("交易不予承兑，请换卡重试"),

    //白条-------start-------
    F1056("渠道异常，请稍后重试"),
    F1057("激活失败，请稍后重试"),
    F1058("授信提交失败，请稍后重试"),
    F1059("白付美尚未激活"),
    F1060("白付美用户异常，请联系客服处理"),
    F1061("授信失败，请重新提交"),
    F1062("该身份ID已用于其他账户授信"),
    F1063("该账户已授信"),
    F1064("授信信息不完备"),
    F1066("可用额度不足"),
    F1067("不支持该分期期数"),
    F1069("退款单已存在"),
    F1070("不支持该金额分期"),
    F1073("该金额不支持分期"),
    F1074("权限不足，操作失败"),
    F1075("内部数据错误"),
    F1076("该授信被冻结，请联系客服处理"),
    F1078("已成功激活，无需再次激活"),
    F1079("不支持该银行"),
    F1080("银行卡已绑定"),
    F1081("银行信息不匹配"),
    F1082("信息不完备"),
    F1083("手机号和银行预留不一致"),
    F1086("暂无数据"),
    F1087("还款金额不准确"),
    F1089("银行扣款失败"),
    F1090("短信流水号不存在"),
    F1093("当前无账单可还"),


    F1097("用户激活失败"),
    F1098("用户已经激活过了"),
    F1099("用户已被列入黑名单"),
    F1100("还款信息不存在"),
    F1102("系统错误，请联系客服"),
    F1103("该交易为风险交易"),
    F1104("用户尚未进行实名认证"),
    F1105("未通过授信"),
    F1106("银行卡错误"),
    F1107("银行业务失败"),
    F1108("白条超时错误码"),
    F1109("单笔金额超限"),
    F1111("今日消费金额已超限"),
    F1112("银行卡户名与账户实名不符"),



    //白条-------end-------

    F1110("鉴权失败"),

    //APPLE PAY BEGIN

    F2000("鉴权失败"),
    F2060("交易失败，详情请咨询您的发卡行"),
    F2061("输入的卡号无效，请确认后输入"),
    F2062("交易失败，发卡银行不支持该商户，请更换其他银行卡"),
    F2063("卡状态不正确"),
    //    F2064("卡上的余额不足"),F1021
    F2065("输入的密码、有效期或CVN2有误，交易失败"),
    F2066("持卡人身份信息或手机号输入不正确，验证失败"),
    F2067("密码输入次数超限"),
    F2068("您的银行卡暂不支持该业务，请向您的银行或95516咨询"),
    F2069("您的输入超时，交易失败"),
    F2070("交易已跳转，等待持卡人输入"),
    F2071("动态口令或短信验证码校验失败"),
    //    F2072("动态口令或短信验证码校验失败"),//F2068
    F2073("支付卡已超过有效期"),
    F2074("扣款成功，销账未知"),
    F2075("扣款成功，销账失败"),
    F2076("需要验密开通"),
    F2077("银行卡未开通认证支付"),
    F2078("发卡行交易权限受限，详情请咨询您的发卡行"),

    //APPLE PAY END

    F8888("第三方系统繁忙"),
    F9999("未知错误");




    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }

    private String value;

    EnumBankRtnCode(String value) {
        this.value = value;
    }
}
